app/controllers/links_controller.rb

  def show
  	@link = Link.find_by_user_id(session[:user_id])
---
SELECT  "links".* FROM "links" WHERE "links"."user_id" = $1 LIMIT 1  [["user_id", 10]]