app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_salt", "password_hash", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "links" SET "user_id" = $1, "updated_at" = $2 WHERE "links"."id" = $3  [["user_id", 10], ["updated_at", "2016-08-17 04:11:08.512511"], ["id", 4]]
---
  def create
    @user = User.new(user_params)
    if @user.save
    	# User registered, now randomly assign a link
    	available_link = Link.get_available_link
    	@link_assigned = false
    	if available_link # Go ahead and assign the link to the user in case of availability, else skip
    		link_assigned = true
    		available_link.user_id = @user.id
    		available_link.save